#+title: Brad's Doom Emacs Config
#+AUTHOR: Brad Northern
#+STARTUP: showeverything

* PACKAGES INIT
#+begin_src emacs-lisp :tangle yes
(condition-case nil
    (require 'use-package)
  (file-error
   (require 'package)
   (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/"))
   (package-initialize)
   (package-refresh-contents)
   (package-install 'use-package)
   (setq use-package-always-ensure t)
   (require 'use-package)))
(add-to-list 'package-archives '("gnu"   . "https://elpa.gnu.org/packages/"))

#+end_src

#+RESULTS:
: ((melpa . http://melpa.org/packages/) (org . http://orgmode.org/elpa/) (gnu . https://elpa.gnu.org/packages/) (nongnu . https://elpa.nongnu.org/nongnu/))

